app/controllers/docs_controller.rb

	def index
		@docs = Doc.all.order("created_at DESC")
---
SELECT "docs".* FROM "docs" ORDER BY created_at DESC