app/controllers/docs_controller.rb

SELECT "docs".* FROM "docs" WHERE "docs"."user_id" = ?  [["user_id", 1]]
---
	def index
		@docs = Doc.where(user_id: current_user)

INSERT INTO "docs" ("title", "content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["title", "docuser1"], ["content", "a"], ["created_at", "2019-10-24 11:24:53.758508"], ["updated_at", "2019-10-24 11:24:53.758508"], ["user_id", 2]]
---
	def create
		@doc = current_user.docs.build(doc_params)

		if @doc.save

DELETE FROM "docs" WHERE "docs"."id" = ?  [["id", 10]]
---
	def destroy
		@doc.destroy

SELECT "docs".* FROM "docs" WHERE "docs"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
		def find_doc
			@doc = Doc.find(params[:id])